// Напишите программу, которая считает сколько джедаев погибло с момента их прибытия и до момента появления мастера Йоды, 
// если известно, что в живых остались 20 рыцарей.
// Количество оставшихся рыцарей должно вводиться с клавиатуры.
import java.io.*;
import java.util.*;

public class Solution {
    public static void main(String[] args) {
        int jedis = 0;
        Scanner scanner = new Scanner(System.in);
        jedis = scanner.nextInt();
        System.out.println(jedis);
    }
}